poiseuille/Re200/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location system;
    object controlDict;
} 

    application icoFoam;

    startFrom latestTime;

    startTime 0;

    stopAt endTime;

    endTime 48.0;

    deltaT 0.01;

    writeControl timeStep;//runTime;

    writeInterval 100;//0.001;

    purgeWrite 0;

    writeFormat ascii;

    writePrecision 10;

    writeCompression uncompressed;

    timeFormat general;

    timePrecision 6;

    graphFormat raw;

    runTimeModifiable true;

    adjustTimeStep no;

    maxCo 1.0;

    maxDeltaT 1.0;

functions
{
    #includeFunc residuals
}

// ************************************************************************* //
